Autodesk.Revit.Creation.Document.NewFlexPipe(Autodesk.Revit.DB.Connector,System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.Plumbing.FlexPipeType)
Adds a new flexible pipe into the document,
using a connector, point array and pipe type.
connector:  The connector to be connected to the flexible pipe, including the end points.
points: The point array indicating the path of the flexible pipe.
pipeType:  The type of the flexible pipe.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector or points is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the flexible pipe cannot be created or regenerate fails.
Returns:  If creation was successful then a new flexible pipe is returned,
otherwise an exception with failure information will be thrown.
Remarks: If the connector is a fitting or equipment connector of the correct domain,
and if the connector's direction matches the direction of the flexible pipe to be created,
the connectors will be automatically connected. A transition fitting will be added
at the connector(s) if necessary. If the connector's type, domain,
does not match the one of the input connector, no connection will be established.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the flexible pipe type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewFlexPipe(System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.Plumbing.FlexPipeType)
Adds a new flexible pipe into the document.
Adds a new flexible pipe into the document,
using a point array and pipe type.
points: The point array indicating the path of the flexible pipe, including the end points.
pipeType:  The type of the flexible pipe.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument points is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the flexible pipe cannot be created or regenerate fails.
Returns:  If creation was successful then a new flexible pipe is returned,
otherwise an exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the flexible pipe type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewFlexDuct(Autodesk.Revit.DB.Connector,System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.Mechanical.FlexDuctType)
Adds a new flexible duct into the document,
using a connector, point array and duct type.
connector:  The connector to be connected to the duct, including the end points.
points: The point array indicating the path of the flexible duct.
ductType:  The type of the flexible duct.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector or points is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the flexible duct cannot be created or regenerate fails.
Returns:  If creation was successful then a new flexible duct is returned,
otherwise an exception with failure information will be thrown.
Remarks: If the connector is a fitting or equipment connector of the correct domain,
and if the connector's direction matches the direction of the flexible duct to be created,
the connectors will be automatically connected. A transition fitting will be added
at the connector(s) if necessary. If the connector's type, domain,
does not match the one of the input connector, no connection will be established.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the flexible duct type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewFlexDuct(System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.Mechanical.FlexDuctType)
Adds a new flexible duct into the document.
Adds a new flexible duct into the document,
using a point array and duct type.
points: The point array indicating the path of the flexible duct, including the end points.
ductType:  The type of the flexible duct.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument points is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the flexible duct cannot be created or regenerate fails.
Returns:  If creation was successful then a new flexible duct is returned,
otherwise an exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the flexible duct type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewRoom(Autodesk.Revit.DB.Architecture.Room,Autodesk.Revit.DB.PlanCircuit)
Creates a new room within the confines of a plan circuit, or places an unplaced room within the confines of the plan circuit.
room:  The room which you want to locate in the circuit.  Pass null to create a new room.
circuit:  The circuit in which you want to locate a room.
Returns:  If successful the room is returned, otherwise null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the existing room is already placed.
Remarks:  This method will regenerate the document even in manual regeneration mode.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the room does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the circuit does not exist in the given document.

Autodesk.Revit.Creation.Document.NewLoadCase(System.String,Autodesk.Revit.DB.Structure.LoadNature,Autodesk.Revit.DB.Category)
Creates a new instance of a LoadCase element within the project.
name: The not empty name for the Load Case Element to create.
nature:  The Load Case nature.
category:  The Load Case category.
Returns: If successful, NewLoadCase and there isn't the Load Case Element
with the same name returns an object for the newly created LoadCase.
If such element exist and match desired one (has the same nature and number),
returns existing element. Otherwise null is returned.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the load case nature does not exist in the given document.

Autodesk.Revit.Creation.Document.NewAreaLoad(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,System.Boolean,Autodesk.Revit.DB.Structure.AreaLoadType)
Creates a new uniform hosted area load with polygonal shape within the project.
host: The host element (Floor or Wall) of the AreaLoad application.
force: The 3d area force applied to the first reference point.
isReaction: Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol: The symbol of the AreaLoad.
Returns: If successful, NewAreaLoad returns an object for the newly created AreaLoad. null is returned
if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the host does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the area load symbol does not exist in the given document.

Autodesk.Revit.Creation.Document.NewAreaLoad(Autodesk.Revit.DB.CurveArray,System.Int32[],System.Int32[],Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Boolean,Autodesk.Revit.DB.Structure.AreaLoadType)
Creates a new unhosted area load with variable forces at the vertices within the project.
curvesArr: An array of curves that define the shape of the area load.
refPntIdxs: The indices of the curves in curvesArr that will be used to define
the reference points for the load.
ends: Identifies which of the curve end points should be used for the reference points,
for each member of refPntIdxs.  The value should be 0 for the start point or 1 for the end point of the curve.
force0: The 3d area force applied to the first reference point.
force1: The 3d area force applied to the second reference point.
Ignored if only one or two reference points are supplied.
force2: The 3d area force applied to the third reference point.
Ignored if only one or two reference points are supplied.
isReaction: Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol: The symbol of the AreaLoad.
Returns: If successful, NewAreaLoad returns an object for the newly created AreaLoad. null is returned
if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the area load symbol does not exist in the given document.
Remarks: The size of the refPntIdxs and
ends arrays must be the same, and a maximum of 3 values is permitted.

Autodesk.Revit.Creation.Document.NewAreaLoad(Autodesk.Revit.DB.CurveArray,System.Int32[],System.Int32[],System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Boolean,Autodesk.Revit.DB.Structure.AreaLoadType)
Creates a new unhosted area load with variable forces at the vertices within the project.
curvesArr: An array of curves that define the shape of the area load curves.
refPntIdxs: The indices of the curves in curvesArr that will be used to define
the reference points for the load.
ends: Identifies which of the curve end points should be used for the reference points,
for each member of refPntIdxs.  The value should be 0 for the start point or 1 for the end point of the curve.
forces: The 3d area forces applied to each of the reference points in the refPntIdxs array.
isReaction: Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol: The symbol of the AreaLoad.
Returns: If successful, NewAreaLoad returns an object for the newly created AreaLoad. null is returned
if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.
Remarks: The size of the refPntIdxs, ends,
and forces arrays must be the same, and a maximum of 3 values is permitted.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the area load symbol does not exist in the given document.

Autodesk.Revit.Creation.Document.NewAreaLoad(System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.XYZ,System.Boolean,Autodesk.Revit.DB.Structure.AreaLoadType)
Creates a new area load in the project.
Creates a new uniform unhosted area load with polygonal shape within the project.
points: Vertexes of AreaLoad shape polygon.
force: The applied 3d area force.
isReaction: Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol: The symbol of the AreaLoad.
Returns: If successful, NewAreaLoad returns an object for the newly created AreaLoad. null is returned
if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the area load symbol does not exist in the given document.

Autodesk.Revit.Creation.Document.NewLineLoad(Autodesk.Revit.DB.Reference,System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Boolean,System.Boolean,System.Boolean,Autodesk.Revit.DB.Structure.LineLoadType,Autodesk.Revit.DB.SketchPlane)
Creates a new hosted line load within the project using data at an array of points.
reference:  The Geometry reference to Beam's, Brace's, Column's,
Wall's, Wall Foundation's, Slab's or Slab Foundation's analytical lines.
forces: The applied 3d linear forces in the end points.
moments: The applied 3d linear moments in the end points.
uniform: Set to True if you wish to create the uniform load.
projected: Set to True if you wish to create the projected load.
isReaction: Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol: The symbol of the LineLoad.
plane: Indicate the work plane of the LineLoad.
Returns: If successful, NewLineLoad returns an object for the newly created LineLoad. null is returned
if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the line load symbol does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the work plane does not exist in the given document.

Autodesk.Revit.Creation.Document.NewLineLoad(Autodesk.Revit.DB.Element,System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Boolean,System.Boolean,System.Boolean,Autodesk.Revit.DB.Structure.LineLoadType,Autodesk.Revit.DB.SketchPlane)
Creates a new hosted line load within the project using data at two points.
host: The host element (Beam, Brace or Column) of the LineLoad application.
forces: The applied 3d linear forces in the end points.
moments: The applied 3d linear moments in the end points.
uniform: Set to True if you wish to create the uniform load.
projected: Set to True if you wish to create the projected load.
isReaction: Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol: The symbol of the LineLoad.
plane: Indicate the work plane of the LineLoad.
Returns: If successful, NewLineLoad returns an object for the newly created LineLoad. null is returned
if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the line load symbol does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the work plane does not exist in the given document.

Autodesk.Revit.Creation.Document.NewLineLoad(System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Boolean,System.Boolean,System.Boolean,Autodesk.Revit.DB.Structure.LineLoadType,Autodesk.Revit.DB.SketchPlane)
Creates a new unhosted line load within the project using data at an array of points.
points: The end points of the LineLoad application.
forces: The applied 3d linear forces in the end points.
moments: The applied 3d linear moments in the end points.
uniform: Set to True if you wish to create the uniform load.
projected: Set to True if you wish to create the projected load.
isReaction: Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol: The symbol of the LineLoad.
plane: Indicate the work plane of the LineLoad.
Returns: If successful, NewLineLoad returns an object for the newly created LineLoad. null is returned
if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the line load symbol does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the work plane does not exist in the given document.

Autodesk.Revit.Creation.Document.NewLineLoad(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Boolean,System.Boolean,System.Boolean,Autodesk.Revit.DB.Structure.LineLoadType,Autodesk.Revit.DB.SketchPlane)
Creates a new line load within the project.
Creates a new unhosted line load within the project using data at two points.
point: The first point of the LineLoad application.
force: The applied 3d linear force in the first point.
moment: The applied 3d linear moment in the first point.
point1: The second point of the LineLoad application.
force1: The applied 3d linear force in the second point.
moment1: The applied 3d linear moment in the second point.
uniform: Set to True if you wish to create the uniform load.
projected: Set to True if you wish to create the projected load.
isReaction: Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol: The symbol of the LineLoad.
plane: Indicate the work plane of the LineLoad.
Returns: If successful, NewLineLoad returns the newly created LineLoad. null is returned
if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the line load symbol does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the work plane does not exist in the given document.

Autodesk.Revit.Creation.Document.NewPointLoad(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Boolean,Autodesk.Revit.DB.Structure.PointLoadType,Autodesk.Revit.DB.SketchPlane)
Creates a new hosted point load within the project.
reference:  The Geometry reference to Beam's, Brace's, Column's,
analytical line's end.
force: The 3d force.
moment: The 3d moment.
isReaction: Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol: The symbol of the PointLoad.
plane: Indicate the work plane of the PointLoad.
Returns: If successful, NewPointLoad returns an object for the newly created PointLoad. null is returned
if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the point load symbol does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the work plane does not exist in the given document.

Autodesk.Revit.Creation.Document.NewPointLoad(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Boolean,Autodesk.Revit.DB.Structure.PointLoadType,Autodesk.Revit.DB.SketchPlane)
Creates a new point load within the project.
Creates a new unhosted point load within the project.
point: The point of the PointLoad application.
force: The 3d force.
moment: The 3d moment.
isReaction: Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol: The symbol of the PointLoad.
plane: Indicate the work plane of the PointLoad.
Returns: If successful, NewPointLoad returns an object for the newly created PointLoad. null is returned
if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the point load symbol does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the work plane does not exist in the given document.